---
kind: property
id: P:Autodesk.Revit.DB.CameraInfo.HorizontalExtent
source: html/8247b292-f93f-684f-8270-a7c2fa92a6c8.htm
---
# Autodesk.Revit.DB.CameraInfo.HorizontalExtent Property

Distance between left and right planes on the target plane.

## Syntax (C#)
```csharp
public double HorizontalExtent { get; }
```